sources/Documents/ПроведениеАттестации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПроведениеАттестации</Name>
			<BasedOn>
				<xr:Item>Document.ПроведениеЗанятия</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Аттестация</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗанятий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАттестации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроведениеЗанятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОценкиСредние</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОценок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийБалл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПропусков</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредварительнаяАттестация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтоговаяОценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсправленнаяОценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

sources/Documents/ПроведениеАттестации/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПроведениеАттестации.ПолучитьМакет("МакетАттестация");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроведениеАттестации.Группа КАК Группа,
	|	ЛЕВ(СТРОКА(ПроведениеАттестации.ДатаАттестации), 10) КАК Дата,
	|	ПроведениеАттестации.Предмет КАК Предмет,
	|	ПроведениеАттестации.ОценкиСредние.(
	|		НомерСтроки КАК Номер,
	|		Студент КАК ФИО,
	|		ИтоговаяОценка КАК Оценка,
	|		ИсправленнаяОценка КАК ОценкаНов
	|	) КАК ОценкиСредние,
	|	ПроведениеАттестации.Предмет.БуквенныйКод КАК ПредметШифр
	|ИЗ
	|	Документ.ПроведениеАттестации КАК ПроведениеАттестации
	|ГДЕ
	|	ПроведениеАттестации.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьНазвание = Макет.ПолучитьОбласть("Название");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаб = Макет.ПолучитьОбласть("ШапкаТаб");
	ОбластьСтрокаТаб = Макет.ПолучитьОбласть("СтрокаТаб");
	ОбластьСтрокаТаб2 = Макет.ПолучитьОбласть("СтрокаТаб2");
	ОбластьПодвалТаб = Макет.ПолучитьОбласть("ПодвалТаб");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьНазвание);

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Предмет = Строка(Выборка.ПредметШифр) + " " + Строка(Выборка.Предмет);
		
		ТабДок.Вывести(ОбластьЗаголовок, Выборка.Уровень());

		ТабДок.Вывести(ОбластьШапкаТаб);
		
		ВыборкаОценкиСредние = Выборка.ОценкиСредние.Выбрать();
		Пока ВыборкаОценкиСредние.Следующий() Цикл
			
			Если ВыборкаОценкиСредние.Оценка = 2 И ВыборкаОценкиСредние.ОценкаНов < 3 Тогда
			
				ОбластьСтрокаТаб2.Параметры.Заполнить(ВыборкаОценкиСредние);
				ОбластьСтрокаТаб2.Параметры.Оценка = ОбщиеФункции.ПреобразоватьОценкуВТекст(ВыборкаОценкиСредние.Оценка);
				ОбластьСтрокаТаб2.Параметры.ОценкаНов = ОбщиеФункции.ПреобразоватьОценкуВТекст(ВыборкаОценкиСредние.ОценкаНов);
				ТабДок.Вывести(ОбластьСтрокаТаб2, ВыборкаОценкиСредние.Уровень());
			
			Иначе
			
				ОбластьСтрокаТаб.Параметры.Заполнить(ВыборкаОценкиСредние);
				ОбластьСтрокаТаб.Параметры.Оценка = ОбщиеФункции.ПреобразоватьОценкуВТекст(ВыборкаОценкиСредние.Оценка);
				ОбластьСтрокаТаб.Параметры.ОценкаНов = ОбщиеФункции.ПреобразоватьОценкуВТекст(ВыборкаОценкиСредние.ОценкаНов);
				ТабДок.Вывести(ОбластьСтрокаТаб, ВыборкаОценкиСредние.Уровень());
			
			КонецЕсли;
			
			
		КонецЦикла;
		
		ОбластьПодвалТаб.Параметры.Препод = ОбщиеФункции.ПолучитьФИОСокращенноеДляПечати(ПараметрыСеанса.ТекПользователь);
		ТабДок.Вывести(ОбластьПодвалТаб);
		ТабДок.АвтоМасштаб = Истина;
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
